[
  {
    "id": 1,
    "title": "Amethyst verified",
    "author": "GDN",
    "date": "2025-05-25",
    "category": "Community",
    "thumbnail": "/gdn/assets/articlethumbnail/1.png",
    "content": "After a long time the top 2nd player on the demon list WPopoff verified the level Amethyst. This level would eventually be the top 1 level on the demon list."
  },
  {
    "id": 2,
    "title": "when will 2.21 come out?",
    "author": "GDN",
    "date":"2025-08-31",
    "category": "Updates",
    "thumbnail": "/gdn/assets/articlethumbnail/2.png",
    "content": "On July 18, RobTop Games announced the Random Gauntlet Contest. However, the Gauntlet textures for this contest are not currently in the game. This means that Geometry Dash 2.21 might release on November 16, 2025. This means that 2.21 would also include the Gauntlet sprites for the Random Gauntlet Contest. <br> There are a lot of things that 2.2 didn't have which said they would release in 2.21. This includes The map, Versus Mode, icons, the new level 'Explorers' and of course the random and chance gauntlets. There are also a lot of things RobTop said would 'come soon' to the tower, main levels and some other ones. These are also tought to be uploaded in 2.21."},
  {
    "id": 3,
    "title": "Cuatrosientos died at 99% on the 7-minute level Flamewall",
    "author": "GDN",
    "date":"2025-08-31",
    "category": "Community",
        "thumbnail": "/gdn/assets/articlethumbnail/3.png",
    "content": "On august 31 2025 the player Cuatrosientos, who is trying to verify the 7-minute long level Flamewall, died at 99%. Many player are sad because of how tragic this is due to its long time and that if he verified it, it would probably be top 1 on the demon list, beating the hardest level at the time of writhing this Amethyst"
  },
  {
    "id": 4,
    "title": "Zoink face reveald in front of 5K people",
    "author": "GDN",
    "date":"2025-09-12",
    "category": "Community",
    "thumbnail": "/gdn/assets/articlethumbnail/4.png",
    "content": "On 12 september the top  player Zoink face reveald on a live stream on youtube with 5K people watching. Zoink was known for being one of the few players who didnt show his face. "
  },
  {
    "id": 5,
    "title": "Thinking Space II rated",
    "author": "GDN",
    "date":"2025-09-19",
    "category": "Community",
    "thumbnail": "/gdn/assets/articlethumbnail/5.png",
    "content": "On September 19, 2025 the level Thinking Space II by Cairox finnaly got rated by Robtop. This level is a sequel to the level Thinking Space which is a very popular level. This level is also very hard and is currently the hardest level in the game according to the demonlist, surpasing the former hardest level Amethyst. The level got rated after Zoink verified it on 25 may 2025, the same day Amethyst got verified. Amethyst got rated almost instantly by robtop but Thinking Space II took a long time to get rated. Many people are happy that this level finally got rated becouse according to Zoink and a lot of other players Thinking Space II is a harder level than Amethyst."
  },
  {
    "id": 6,
    "title": "Where is Cuatrocientos ?",
    "author": "GDN",
    "date": "2025-09-20",
    "category": "Community",
    "thumbnail": "/gdn/assets/articlethumbnail/6.png",
    "content": "Cuatrocientos , the player who is trying to verify the 7-minute long level Flamewall, has not bean streaming the past days. Many people are wondering where he is and why he hasn't been online for a while. Some people think he might be taking a break from the game, while others think he might be working on something big. Only time will tell where Cuatrocientos  is and when he will return to the game. Cuatrocientos has not been active on social media either, which has led to more speculation about his whereabouts. Fans are eagerly awaiting any news about his return and are hoping that he will be back soon to continue his quest to verify Flamewall. He already got 99% on the level twice, so many people are excited to see if he can finally complete it and achieve his goal."
  },
  {
    "id": 7,
    "title": "Flamewall verified!",
    "author": "GDN",
    "date": "2025-09-22",
    "category": "Community",
    "thumbnail": "/gdn/assets/articlethumbnail/7.png",
    "content": "Yesterday, september 21 2025, the player Cuatrocientos would verify the 7-minute long level Flamewall. He died on 99% on the level twice, so this was a huge accomplishment. The level Thinking Space II got rated on 19 september, and got 1st on the demon list, but many players think now that Cuatrocientos verified Flamewall, it wil be 1st on the demon list."
  },
  {
    "id": 8,
    "title": "Flamewall rated!",
    "author": "GDN",
    "date": "2025-09-25",
    "category": "Community",
    "thumbnail": "/gdn/assets/articlethumbnail/8.png",
    "content": "on september 25, 2025, the level Flamewall got rated by Robtop. This level is now the hardest level in the game, beating Thinking Space II. Many people are happy that this level finally got rated because according to many players Flamewall is a harder level than Thinking Space II, even tho it is now rated for just a few hours. Many players are happy to see the level being rated just 3 days after Cuatrocientos verified it, while Thinking Space II took months to get rated after Zoink verified it."
  },
  {
    "id": 9,
    "title": "All the wraith vault codes 2025",
    "author": "GDN",
    "date": "2025-09-26",
    "category": "tutorials",
    "thumbnail": "/gdn/assets/articlethumbnail/9.png",
    "content": "These are all of the wraith vault codes in 2025: <br><br> GD2025<br>Back on Dash<br>Geometry<br>Citadel<br>Retrospective<br>Ruins<br>Cheat Codes<br>Backstreet Boy<br>Noel Electra<br>Duckstep<br>Skyline Pt 2<br>Boogie<br>Button Masher<br>SpaceGauntlet<br>Key<br>CheckSteam<br>RobTopIsNice<br>FireInTheHole<br>Skibidi<br>WellMet<br>WaterOnTheHill<br>ThickOfIt<br>Bussin<br>TouchGrass<br><br>To get to the wraith vault, you need to go to the tower, open it and then on the right bottom corner you should see something that looks like the Cursed Thorn. Click on it and you should see the wraith. Have fun!"
  },
  {
    "id": 10,
  "title": "Streamer Vortrox beat Yatagarasu!",
  "author": "GDN",
    "date": "2025-10-02",
    "category": "Community",
    "thumbnail": "/gdn/assets/articlethumbnail/10.png",
    "content": "On October 1, 2025, the popular streamer Vortrox beat the level Yatagarasu, which is known for being one of the hardest levels in Geometry Dash. Vortrox has been streaming his attempts to beat the level for weeks, and his fans have been cheering him on every step of the way. After many failed attempts and close calls, Vortrox finally managed to complete the level and achieve his goal. His stream was filled with excitement and celebration as he shared the moment with his viewers. Many people are congratulating Vortrox on his achievement and praising his dedication and perseverance in beating such a challenging level. This is a major accomplishment for vortrox and his fans, due to his problems with his great-grandmother passing away recently."   
},
  {
    "id": 11,
  "title": "New event level Eta Carnis",
  "author": "GDN",
    "date": "2025-10-10",
    "category": "Events",
    "thumbnail": "/gdn/assets/articlethumbnail/11.png",
    "content": "ETA Carnis became the 19th Event level in the popular game Geometry Dash, succeeding FUNHOUSE. This level is unique as it has been classified with a Mythic rating and is also noted for its Halloween theme. The level is the first mythic 6 star level. It is a mega-collabiration and the host is GloryEX"   
},
  {
    "id": 12,
  "title": "A new update wil come over 1 month",
  "author": "GDN",
    "date": "2025-10-16",
    "category": "Updates",
    "thumbnail": "/gdn/assets/articlethumbnail/12.png",
    "content": "Today, oktober 16 2025, we are exactly 31 days away from a new update to GD. This is because on 16 november 2025 the random and chance gauntlet wil come out. Players where quick to find that the sprites for the gauntlets are not yet in the files. So there will be a update on 16 november. There is a chance Robtop makes the sprites server-side, so the sprites are on the computer of Robtop and not on the one of the player, but the chances are low. We are just going to have to wait."   
},
{
  "id": 13,
  "title": "EVW beat Sonic Wave!",
  "author": "GDN",
  "date": "2025-10-19",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/13.png",
  "content": "EVW is one of the most populair gd content creators. He decided to try to beat RGB, a list that contains the top 3 levels back in 2017 on the demonlist. RGB consists of Yatagarasu, Erebus and of course Sonic Wave. EVW already beat Yatagarasu and Erebus, so it was cool to see him beat the last level Sonic Wave, which is the hardest one of the 3 levels."},
{
  "id": 14,
  "title": "Bencar face revealed!",
  "author": "GDN",
  "date": "2025-10-19",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/14.png",
  "content": "The player Bencar, who together with NotVixios has the channel SecretWayGD, was livestreaming his progress on Zodiac when he said that if he got 100 dollars he would face reveal. Not even a minute later someone donated 100 dollars and Bencar face reveald on the spot. Now there is a new meme in the community because he looks like Npesta"},
{
  "id": 15,
  "title": "Nullscapes hackers are everywere!",
  "author": "GDN",
  "date": "2025-10-21",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/15.png",
  "content": "Nullscapes is a level made by Kiba and verified by Zoink. The level is the sequel to Shardscapes. Since Zoink verified it, it has been placed 4th on the demonlist, but nobody else has beaten it yet. <br> Because the level is so hard and everybody wants to see someone beat it, there are a lot of hackers in Nullscapes. The player Danielcookie was seen as the best mobile gd player, and he said he beat Nullscapes very easy. This grew some suspision on his friend who made a copy of Danielcookie's level and it was just too easy, like something felt wrong. The friend whent in the editor and found a lot of invisable option triggers under the level.<br>There are also some other hackers. CookieIsMine was seen as one of the best players in Nullscapes, but it was later found he was playing 'Nullscapes hold'. He confessed to doing this on Twitter on 16 October 2025, after the Demonlist moderators supposedly forced him to, because he had been posting fake progress on his Twitter account. On top of that, his Pointecrate account has been banned for three months. CookieIsMine also provided that Secret Way's video about his notable progress made him feel guilty, causing him to make his faked runs more obvious, and finally playing the level with an Elmo costume. Despite faking his runs, CookieIsMine has made legitimate progress on the level of 44-80% and 63-100%, saying that he really wants to beat the level in the future."},
{
  "id": 16,
  "title": "Vortrox verified a new extreme demon!",
  "author": "GDN",
  "date": "2025-10-23",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/16.png",
  "content": "After beating Yatagarasu on stream, the streamer and content creator Vortrox took a break from playing and went to NYC for a trip. Despite this, on august 21, 2025, Vortrox would announce he would try to verify a new extreme demon called 'Fallen Horizon' a megacollab with great decoration. He would get 69% on the level after just 2 hours of playing. Nice! He would quickly get 80% after that and then verified the level after just 1700 attempts!"},
{
  "id": 17,
  "title": "Nullscapes just got its first legit victor!",
  "author": "GDN",
  "date": "2025-10-24",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/17.png",
  "content": "Yesterday, the player spookkd would be the first victor of Nullscapes. The level was verified by Zoink and since then players where thrying to beat the level. Even tho a few of players said they did it, they where later exposed for hacking."},
{
  "id": 18,
  "title": "Flamewall got placed on the demonlist!",
  "author": "GDN",
  "date": "2025-10-25",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/18.png",
  "content": "After exactly 1 month of Flamewall being rated, the level got placed on the demonlist on place 3, after Amethyst and before Tidal Wave. The level was originally verified by Cuatrocientos. The level has a timespan over 7 minutes."},
{
  "id": 19,
  "title": "Random gauntlet deadline got extended",
  "author": "GDN",
  "date": "2025-11-3",
  "category": "Updates",
  "thumbnail": "/gdn/assets/articlethumbnail/19.png",
  "content": "On november 3rd, 2025, RobtopGames would post on youtube and discord that the deadline for the random gauntlet will be moved from november 16 to december 14. This would give creators more time to finish their levels. The submissions where according to Robtop low but a lot of people asked to move the deadline. This also means that our theorie about the update that would come, will also be later that expected. The levels that will win will be in game on december 20, 2025, 4 pm EST. Then the update would probably come out. In RobTop's own words he said: 'This extension was given due to more creators than usual requesting more time to finish their level, which is also noticeable in the relatively low number of entries. It makes sense that making an entry for this contest takes more time because of the randomization rule, which means that you may have to make several versions of parts of your level.' You can view the full youtube post <a href='https://www.youtube.com/post/UgkxZItuRNOg4BXau4fziuf8sEmMkM9iTxnR' target='_blank'> here</a> ."},
{
  "id": 20,
  "title": "Vortrox beat Low Death!",
  "author": "GDN",
  "date": "2025-11-7",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/20.png",
  "content": "Vortrox announced that he would take on Low Death, an extreme demon that has become infamous for taking an astonishing five years to verify. This is noteworthy because it reflects his confidence and skill, as this is the fewest attempts he has ever put into an extreme demon. On November 7, 2025, he successfully completed Low Death after a total of 7,132 attempts.<br>What makes this level particularly challenging are its many difficult sections that require not just skill but also precise timing and quick reflexes. In addition to these hard parts, Low Death is packed with hidden easter eggs, which reward players for exploring and can add unexpected surprises to the gaming experience. Vortrox's accomplishment not only highlights his dedication but also serves as an inspiration to others in the gaming community looking to tackle their own difficult challenges."},
  
{
  "id": 21,
  "title": "Zoink almost beat FlameWall",
  "author": "GDN",
  "date": "2025-11-17",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/21.png",
  "content": "On November 2nd, 2025, Zoink made an exciting announcement that he would rebeat the entire main list of levels, which includes the newly added level FlameWall. This initiative thrilled his fans and the gaming community, as it showcased his dedication to mastering every challenge presented. The anticipation built up as players eagerly awaited updates on his progress.<br>On November 16, Zoink hosted a live stream where he played through FlameWall. During the stream, he achieved a new personal best of 63%, a significant milestone that demonstrated his skill and determination. However, the excitement didn’t stop there. Shortly after reaching that impressive percentage, Zoink pushed himself further and managed to score 68%. This feat tied him with another prominent player, zLevii, who was the first to achieve a world record of 68% on the same level about a month ago.<br>And then Zoink didn't felt like it was enough, because then he finished a run from 16-100%, breaking the previous record of 24-97%"},
{
  "id": 22,
  "title": "What will come in 2.21?",
  "author": "GDN",
  "date": "2025-11-24",
  "category": "Updates",
  "thumbnail": "/gdn/assets/articlethumbnail/22.png",
  "content": "2.21 is speculated to release on 20 december, 2025, 4pm EST. We will see what will come in this update here. <br><br> The main level that should come out in 2.2 was Explorers, but it got delayed to 2.21. This would come out.<br> The map would come out. It would be something like GD world, but with custom made platformer levels.<br> Together with the map, versus mode is also a button that is in the game, but is still delayed. It should be a kind of multiplayer competition mode. <br> The Random and Chance gauntlet will come out. These where the ones that gave us the day the update would come out, because the images are not in the files yet. <br> And of course the icons. There where a lot of icons that would come out in 2.21, so these would come.<br><br>Now we just think 2.21 will come out then, but there are a few diffrent things that could happen. There is a chance the update would just add the gauntlets, and be update 2.208 or something."},
{
  "id": 23,
  "title": "Zoink died at 99% in FlameWall",
  "author": "GDN",
  "date": "2025-11-25",
  "category": "Community",
  "thumbnail": "/gdn/assets/articlethumbnail/23.png",
  "content": "Zoink has been playing the top 3 level FlameWall for a short time, but is already the best player after the Cuatrocientos, the verifier of the level. Just 1 week ago Zoink would get 68%, which was the world record at the time, tied with zLevii. He also got a run of 16-100% that same stream. <br> But in Zoinks last stream he got to 99%, the place where Cuatrocientos died twice, and the curse stayed because Zoink died at 99.5% in the level."}
] 