[
  {
    "id": 1,
    "title": "Amethyst verified",
    "author": "GDN",
    "date": "2025-08-01",
    "category": "Community",
    "content": "After a long time the top 1 player on the demon list Zoink verified the level Amethyst. This level would eventually be the first level on the demon list."
  },
  {
    "id": 2,
    "title": "when will 2.21 come out?",
    "author": "GDN",
    "date":"2025-08-31",
    "category": "Updates",
    "thumbnail": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%2Fid%2FOIP._Clgq0Y34KjQiQuFabF4cQHaEK%3Fpid%3DApi&f=1&ipt=ff9d747769474da7cca4b4845fad8ecfb929962372b7a1e7f2dd0022cae8c470&ipo=images",
    "content": "On July 18, RobTop Games announced the Random Gauntlet Contest. However, the Gauntlet textures for this contest are not currently in the game. This means that Geometry Dash 2.21 might release on November 16, 2025. This means that 2.21 would also include the Gauntlet sprites for the Random Gauntlet Contest. <br> This could get delayed and it probably is gonna happen becouse robtop is not that good at giving release dates."
  },
  {
    "id": 3,
    "title": "Cuatrosientos died at 99% on the 7-minute level Flamewall",
    "author": "GDN",
    "date":"2025-08-31",
    "category": "Community",
    "content": "On august 31 2025 the player Cuatrosientos, who is trying to verify the 7-minute long level Flamewall, died at 99%. Many player are sad because of how tragic this is due to its long time and that if he verified it, it would probably be top 1 on the demon list, beating the hardest level at the time of writhing this Amethyst"
  },
  {
    "id": 4,
    "title": "Zoink face reveald in front of 5K people",
    "author": "GDN",
    "date":"2025-09-12",
    "category": "Community",
    "content": "On 12 september the top  player Zoink face reveald on a live stream on youtube with 5K people watching. Zoink was known for being one of the few players who didnt show his face. "
  },
  {
    "id": "5",
    "title": "10 Easiest Geometry Dash Demons To Get 100 Free Stars",
    "author": "Moldy",
    "date": "2024-09-30",
    "category": "levels",
    "thumbnail": "https://i.ytimg.com/vi/pAxWLIOZItU/maxresdefault.jpg",
    "content": "In Geometry Dash, demon levels reward you with 10 stars, the highest reward available in online levels. This is why we've compiled a list of the 10 easiest Geometry Dash demons to help you get 100 free stars. While some demon levels are hard and other demon levels feature secret ways that can get patched, this is a list of easy Geometry Dash demons that are widely regarded as the easiest in the game. This easy demon list will consist of classic easy demons and newer ones that you may not have heard of before in order to maximize the amount of new stars you can collect. <br><br> The Lightning Road (55520) <br> The Lightning Road by Timeless Real is considered one of the easiest Geometry Dash demons. After one playthrough in practice mode you should be well on your way to completing it and acquiring 10 easy stars. <br> Level ID: 55520<br><br>The Nightmare (13519) <br>The Nightmare by Jax is regarded as one of the easiest Geometry Dash demon. If you want a free demon, completing this and getting its 10 stars should be easy. <br>Level ID: 13519<br> <br>"
  }
]
